x = "Python is awesome"
print(x)
#==================================================================
x = "Python"
y = "is"
z = "awesome"
print(x, y, z)
#==================================================================
x = "Python "
y = "is "
z = "awesome"
print(x + y + z)
#==================================================================
x = 5
y = 10
print(x + y)
#==================================================================
"""
x = 5
y = "John"
print(x + y) - ошибка, так как нельзя разные значения совмещять,
пока, конечно, мы не переведем int -> string 
"""
#==================================================================
x = 5
y = "John"
print(x, y)